# Eclipse--Set
Eclipse的那些设置




>>>>>>>>>>>>>>>>>>>>>>    Eclipse导出偏好设置


很多同学都会碰到这样的问题，就是原先在自己的笔记本上进行项目开发，对于Eclipse和Android Studio中的各项设置已经非常熟悉和满意，
如背景设置，快捷键设置，编码设置等等。如果此时需要到另一台公司电脑进行开发，必须重装Eclipse和Android Studio，
如果现在对那些自定义设置重头开始配置的话，那就极为麻烦的，也是效率相当低下的。如果看到同事的IDE环境设置非常好，想要拿过来直接用，
那么本篇文章将是非常有用的。
本篇文章分别演示在Eclipse中和Android Studio中进行IDE各种设置的导入与导出，提高你的配置效率。

（1）Eclipse
[1]导出偏好设置：选择FIle-->Export-->General-->Preferences,也就是导出偏好设置。如图所示：


在上方选择Export All.也就是导出所有偏好设置，如果你只是想导出某些偏好设置，也可以在下面进行选择。
然后点击“Browser”,选择导出的路径，文件名可以自己写，默认保存的文件后缀为*.epf.导出


-------------------------------------------------------
[2]导入偏好设置：选择File-->Import-->General-->Preferences.如图所示：
